Revit 2024 API
BuiltInFailures.ElevationFailures.ElevationDetach Property
 An Elevation arrow can't keep its Crop Region extents attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElevationDetach { get; }
Visual Basic
Public Shared ReadOnly Property ElevationDetach As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElevationDetach {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElevationFailures Class
Autodesk.Revit.DB Namespace